# Data Cleaning assignment MLD28March

In [81]:
import numpy as np
import pandas as pd

In [82]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [83]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [84]:
fl_num=pd.Series(df['FlightNumber'],dtype='Int64')

# Q1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [85]:
# Algo to replace missing value with the requirement

fl_num.fillna(0, inplace=True)
prev_val=0
for key,value in fl_num.iteritems():
    curr_val=value
    if curr_val==0:
          curr_val=prev_val+10
    else:
        prev_val=curr_val
    
    fl_num[key]=curr_val
 
fl_num

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: Int64

In [86]:
df['FlightNumber']=fl_num

In [87]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

# 2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [88]:
df.columns.str.strip().str.lower().str.replace('_','')

Index(['fromto', 'flightnumber', 'recentdelays', 'airline'], dtype='object')

In [89]:
df['from']=df.From_To.str.split('_').str.get(0)

In [90]:
df['to']=df.From_To.str.split('_').str.get(1)

In [91]:
df=df.reindex(columns=['from','to','Airline','FlightNumber','RecentDelays'])

In [92]:
df.dtypes

from            object
to              object
Airline         object
FlightNumber     Int64
RecentDelays    object
dtype: object

# 3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [93]:
df['from']=df['from'].str.title()
df['to']=df['to'].str.title()

In [94]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   from          5 non-null      object
 1   to            5 non-null      object
 2   Airline       5 non-null      object
 3   FlightNumber  5 non-null      Int64
 4   RecentDelays  5 non-null      object
dtypes: Int64(1), object(4)
memory usage: 333.0+ bytes

In [95]:
df

       from         to              Airline  FlightNumber  RecentDelays
0    London      Paris               KLM(!)         10045      [23, 47]
1    Madrid      Milan    <Air France> (12)         10055            []
2    London  Stockholm  (British Airways. )         10065  [24, 43, 87]
3  Budapest      Paris       12. Air France         10075          [13]
4  Brussels     London          "Swiss Air"         10085      [67, 32]

# 5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [96]:
df.RecentDelays

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

In [97]:
delayDF=pd.DataFrame(data=df['RecentDelays'])

In [98]:
delayDF

   RecentDelays
0      [23, 47]
1            []
2  [24, 43, 87]
3          [13]
4      [67, 32]

In [99]:
df[['delay_1','delay_2','delay_3']]=pd.DataFrame(df['RecentDelays'].to_list(), dtype='Int64', index=df.index)

In [100]:
df

,from,to,Airline,FlightNumber,RecentDelays,delay_1,delay_2,delay_3
0,London,Paris,KLM(!),10045,"[23, 47]",23,47,<NA>
1,Madrid,Milan,<Air France> (12),10055,[],<NA>,<NA>,<NA>
2,London,Stockholm,(British Airways. ),10065,"[24, 43, 87]",24,43,87
3,Budapest,Paris,12. Air France,10075,[13],13,<NA>,<NA>
4,Brussels,London,"""Swiss Air""",10085,"[67, 32]",67,32,<NA>

In [101]:
df.drop('RecentDelays', axis=1, inplace=True)

In [102]:
df.fillna(0, inplace=True)

In [103]:
df

,from,to,Airline,FlightNumber,delay_1,delay_2,delay_3
0,London,Paris,KLM(!),10045,23,47,0
1,Madrid,Milan,<Air France> (12),10055,0,0,0
2,London,Stockholm,(British Airways. ),10065,24,43,87
3,Budapest,Paris,12. Air France,10075,13,0,0
4,Brussels,London,"""Swiss Air""",10085,67,32,0

In [104]:
df['Airline']=df.Airline.str.replace(r'[^a-zA-Z ]',r'',regex=True)

In [105]:
df

,from,to,Airline,FlightNumber,delay_1,delay_2,delay_3
0,London,Paris,KLM,10045,23,47,0
1,Madrid,Milan,Air France,10055,0,0,0
2,London,Stockholm,British Airways,10065,24,43,87
3,Budapest,Paris,Air France,10075,13,0,0
4,Brussels,London,Swiss Air,10085,67,32,0